tests/resources/swagger/auth-basic-local-converted.yaml
---
execution:
- concurrency: 1
  hold-for: 1m
  scenario: BZM-API
scenarios:
  BZM-API:
    default-address: ${default-address}
    requests:
    - headers:
        Authorization: Basic ${__base64Encode(${auth})}
      url: ${default-path}/tests
    variables:
      auth: USER:PASSWORD
settings:
  env:
    default-address: https://a.blazemeter.com
    default-path: /api/v4