tests/resources/swagger/auth-key-as-param-converted.yaml
---
execution:
- concurrency: 1
  hold-for: 1m
  scenario: BZM-API
scenarios:
  BZM-API:
    default-address: ${default-address}
    requests:
    - body:
        api_key: ${myApiKey}
      url: ${default-path}/tests
    variables:
      myApiKey: TOKEN
settings:
  env:
    default-address: https://a.blazemeter.com
    default-path: /api/v4