tests/resources/swagger/bzm-api-converted.yaml
---
execution:
- concurrency: 1
  hold-for: 1m
  scenario: /tests
- concurrency: 1
  hold-for: 1m
  scenario: /tests/1
- concurrency: 1
  hold-for: 1m
  scenario: /tests/1/start
- concurrency: 1
  hold-for: 1m
  scenario: /reports
- concurrency: 1
  hold-for: 1m
  scenario: /reports/1
scenarios:
  /reports:
    default-address: https://a.blazemeter.com
    requests:
    - url: /${basePath}/reports
    variables:
      basePath: /api/v4
  /reports/1:
    default-address: https://a.blazemeter.com
    requests:
    - url: /${basePath}/reports/1
    variables:
      basePath: /api/v4
  /tests:
    default-address: https://a.blazemeter.com
    requests:
    - url: /${basePath}/tests
    - method: POST
      url: /${basePath}/tests
    variables:
      basePath: /api/v4
  /tests/1:
    default-address: https://a.blazemeter.com
    requests:
    - url: /${basePath}/tests/1
    - method: PUT
      url: /${basePath}/tests/1
    - method: DELETE
      url: /${basePath}/tests/1
    - method: PATCH
      url: /${basePath}/tests/1
    variables:
      basePath: /api/v4
  /tests/1/start:
    default-address: https://a.blazemeter.com
    requests:
    - method: POST
      url: /${basePath}/tests/1/start
    variables:
      basePath: /api/v4