tests/resources/swagger/bzm-api-converted.yaml
---
execution:
- concurrency: 1
  hold-for: 1m
  scenario: /tests
- concurrency: 1
  hold-for: 1m
  scenario: /tests/1
- concurrency: 1
  hold-for: 1m
  scenario: /tests/1/start
- concurrency: 1
  hold-for: 1m
  scenario: /reports
- concurrency: 1
  hold-for: 1m
  scenario: /reports/1
scenarios:
  /reports:
    default-address: ${defaultAddress}
    requests:
    - url: /${basePath}/reports
  /reports/1:
    default-address: ${defaultAddress}
    requests:
    - url: /${basePath}/reports/1
  /tests:
    default-address: ${defaultAddress}
    requests:
    - url: /${basePath}/tests
    - method: POST
      url: /${basePath}/tests
  /tests/1:
    default-address: ${defaultAddress}
    requests:
    - url: /${basePath}/tests/1
    - method: PUT
      url: /${basePath}/tests/1
    - method: DELETE
      url: /${basePath}/tests/1
    - method: PATCH
      url: /${basePath}/tests/1
  /tests/1/start:
    default-address: ${defaultAddress}
    requests:
    - method: POST
      url: /${basePath}/tests/1/start
settings:
  env:
    basePath: /api/v4
    defaultAddress: https://a.blazemeter.com