tests/resources/swagger/bzm-api-converted.yaml
---
execution:
- concurrency: 1
  hold-for: 1m
  scenario: /tests
- concurrency: 1
  hold-for: 1m
  scenario: /tests/1
- concurrency: 1
  hold-for: 1m
  scenario: /tests/1/start
- concurrency: 1
  hold-for: 1m
  scenario: /reports
- concurrency: 1
  hold-for: 1m
  scenario: /reports/1
scenarios:
  /reports:
    default-address: ${default-address}
    requests:
    - url: ${default-path}/reports
  /reports/1:
    default-address: ${default-address}
    requests:
    - url: ${default-path}/reports/1
  /tests:
    default-address: ${default-address}
    requests:
    - url: ${default-path}/tests
    - method: POST
      url: ${default-path}/tests
  /tests/1:
    default-address: ${default-address}
    requests:
    - url: ${default-path}/tests/1
    - method: PUT
      url: ${default-path}/tests/1
    - method: DELETE
      url: ${default-path}/tests/1
    - method: PATCH
      url: ${default-path}/tests/1
  /tests/1/start:
    default-address: ${default-address}
    requests:
    - method: POST
      url: ${default-path}/tests/1/start
settings:
  env:
    default-address: https://a.blazemeter.com
    default-path: /api/v4