tests/resources/swagger/bzm-converted-none.yaml
---
execution:
- concurrency: 1
  hold-for: 1m
  scenario: BZM-API
scenarios:
  BZM-API:
    default-address: ${default-address}
    requests:
    - url: ${default-path}/tests
    - method: POST
      url: ${default-path}/tests
    - url: ${default-path}/tests/{testId}
    - method: PUT
      url: ${default-path}/tests/{testId}
    - method: DELETE
      url: ${default-path}/tests/{testId}
    - method: PATCH
      url: ${default-path}/tests/{testId}
    - method: POST
      url: ${default-path}/tests/{testId}/start
    - url: ${default-path}/reports
    - url: ${default-path}/reports/{reportId}
settings:
  env:
    default-address: https://a.blazemeter.com
    default-path: /api/v4